#Маршрутка
#Водители маршруток согласны делать рейс только если все места заняты. Вместимость маршрутки 15 человек. На остановку пришло n человек. Определите, сколько людей сможет уехать на маршрутках, и скольким придется добираться другими способами.

#Формат входных данных
#Одно натуральное число — количество человек на остановке.

#Формат результата
#Через пробел два целых числа — количество людей, уехавших на маршрутках, и количество людей, оставшихся на остановке.

n = int(input())

a = (n//15)*15
b = n%15

print(a, b)
