#Цена товара указана в рублях в виде одного вещественного числа не более чем с двумя знаками после точки. Требуется вывести цену товара в рублях и копейках. Формат вывода смотрите в примерах

#Формат входных данных
#Одно вещественное положительное число не более чем с двумя знаками после точки Число не превосходит 1000.

#Формат результата
#В первой строке вывести буквы номера, а во второй строке — цифры

price = float(input())
n = round(price * 100)

rub = n // 100
kop = n % 100

print(f"{rub} rub {kop} kop")
