#Организации требуется распечатать отчет на принтере. Отчет требуется напечатать в n экземплярах. Отчет состоит из m листов.
#Для печати отчета требуется закупить бумагу. Бумага продается пачками по 200 листов. 
#Одна пачка бумаги стоит c рублей. При этом в конторе осталась одна начатая пачка бумаги, в которой осталось k листов. 
#Сколько денег придется потратить для закупки бумаги для печати отчета.

#Формат входных данных
#Через пробел записаны 4 натуральных числа: n, m, c, k. Все числа не превосходят 1000.

#Формат результата
#Одно число — ответ к задаче.

n, m, c, k = map(int, input().split())

totl = n * m

need = totl - k

if need <= 0:
    print(0)
else:
    pack = (need + 199) //200
    print(pack *c)
