#На вещественной прямой по заданным координатам x и y поставили две точки. Эти точки соединили отрезком. Сколько точек с целыми координатами принадлежит отрезку?

#Формат входных данных
#В одной строке два вещественных числа x и y; x<y.

#Формат результата
#Вывести одно число — ответ к задаче

x, y = map(float, input().split())

left = int(x)
if left < x:
    left += 1

right = int(y)
if right > y:
    right -= 1

if left <= right:
    ans = right - left + 1
else:
    ans = 0

print(ans)
