#Однажды Алиса написала на полоске бумаги строчку, состоящую из открывающих и закрывающих круглых скобок, 
#и положила эту полоску на стол, перпендикулярно зеркалу, которое там стояло. 
#К ее удивлению в зеркале она тоже увидела последовательность скобок, но немного другую.

#Ваша задача — по исходной последовательности скобок найти ее отражение.

#Формат входных данных
#Одна строка, состоящая только из круглых скобок. Длина строки не превосходит 50 символов.

#Формат результата
#Одна строка — отражение исходной строки.

s = input()
revers = s[::-1]

res = ""

for char in revers:
    if char == '(':
        res += ')'
    else:
        res += '('

print(res)
