#В одной строке через пробел записано несколько целых чисел. Для каждого из чисел программа должна найти и вывести его минимальный делитель больший единицы. Все ответы выводятся в одной строке через пробел.

#Формат входных данных
#Несколько чисел, записанных через пробел в одной строке. Общее количество чисел и сами числа не превосходят 1000.

#Формат результата
#Через пробел в одной строке минимальные делители.

n = list(map(int, input().split()))

res = []

for num in n:
    for i in range(2, num + 1):
        if num % i == 0:
            res.append(i)
            break  

print(*(res))
