#Маша и Даша идут в школу мимо длинной автомобильной пробки. Чтобы потренироваться в устном счете, они играют в такую игру. 
#Берется номер автомобиля, стоящего в пробке. Если номер делится на 3 без остатка, то два очка получает Маша, иначе одно очко получает Даша.

#По номерам всех автомобилей, стоящих в пробке определите счет в конце игры

#Формат входных данных
#В первой строке записано натуральное число n, n≤1000. В следующих n строках по одному в строке записаны n натуральных чисел — номера автомобилей.

#Формат результата
#Вывести счет игры: количество очков у Маши и количество очков у Даши через двоеточие.

n = int(input())
m = 0
d = 0

for _ in range(n):
  car= int(input())
  if car % 3 == 0:
    m += 2
  else:
    d += 1

print(f"{m}:{d}")
