#Компании предложили выполнить некоторое количество работ. Для каждой работы известна ее стоимость, а специалисты компании определили затраты на ее выполнение. 
#Ваша задача — определить какую максимальную прибыль может получить компания в результате выполнения некоторых из предложенных работ

#Формат входных данных
#В первой строке записано натуральное число n. Далее в n строках записано по два целых числа: стоимость выполнения работы и затраты. Все числа не превосходят 1000.

#Формат результата
#Одно число — ответ к задаче.

n = int(input())
sum = 0

for _ in range(n):
    a, b = map(int, input().split())
    4
    if a > b:
        sum += a - b

print(sum)
